
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДЗ_ПересчитатьТаблицу(Команда)
	
	// Добавлена возможность пересчета таблицы Товары с учетом согласованной скидки 
	// при нажатии на кнопку 
	// Пересчет  работает всегда при любых нажатиях и изменениях. 
	
	Если Объект.Товары.Количество() <> 0 Тогда
		
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			РассчитатьСуммуСтроки(ТекущаяСтрока);   		
		КонецЦикла;     
		
		РассчитатьСуммуДокумента();   
		
	КонецЕсли;	    
	
	Если Объект.Услуги.Количество() <> 0 Тогда   
		
		Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
			РассчитатьСуммуСтроки(ТекущаяСтрока);
		КонецЦикла;       
		
		РассчитатьСуммуДокумента(); 
		
	КонецЕсли;   
	
	// Конец доработки }}	
	
КонецПроцедуры



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные) 
	
	// Добавлена возможность расчета Суммы с учетом согласованной скидки
 	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена * (100 - Объект.ДЗ_СогласованнаяСкидка) / 100; 
	// Конец доработки }}
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДЗ_СогласованнаяСкидкаПриИзменении(Элемент)     
	
	// Добавлена возможность перерасчета Сумм в строках 
	// табличной части Товары с учетом согласованной скидки
 	 	
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;     
	
	Режим = РежимДиалогаВопрос.ДаНет;
			
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Изменен процент скидки. Пересчитать таблицу товаров и услуг?'"), РежимДиалогаВопрос.ДаНет);
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
    КонецЕсли;
	
	Если Объект.Товары.Количество() <> 0 Тогда
		
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			РассчитатьСуммуСтроки(ТекущаяСтрока);   		
		КонецЦикла;     
		
		РассчитатьСуммуДокумента();   
		
	КонецЕсли;	    
	
	Если Объект.Услуги.Количество() <> 0 Тогда   
		
		Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
			РассчитатьСуммуСтроки(ТекущаяСтрока);
		КонецЦикла;       
		
		РассчитатьСуммуДокумента(); 
		
	КонецЕсли;
	
	// Конец доработки }}
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти



